# SetDefaultOpacityByClass

## Description
Sets the default opacity to use the current class opacity.

```pascal
PROCEDURE SetDefaultOpacityByClass;
```

```python

def vs.SetDefaultOpacityByClass():
    return None
```

## Version
Availability: from VectorWorks 2008
## Category
* Document Attributes